#### MEPFamilyConnectorInfo Members

---

|  |
| --- |
| MEPFamilyConnectorInfo Class   Methods   Properties   See Also |

The  MEPFamilyConnectorInfo  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  MEPConnectorInfo  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAssociateFamilyParameterId | Gets the associate family parameter id of the specified connector parameter id. |
| Public method | GetConnectorParameterValue | Gets the parameter value of the specified connector parameter id. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsPrimary | True if this is the primary connector. (Inherited from  MEPConnectorInfo  .) |
| Public property | IsSecondary | True if this is the secondary connector. (Inherited from  MEPConnectorInfo  .) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  MEPConnectorInfo  .) |
| Public property | LinkedConnector | The linked connector or    a null reference (  Nothing  in Visual Basic)  if there is no linked connector (Inherited from  MEPConnectorInfo  .) |

# See Also

MEPFamilyConnectorInfo Class

Autodesk.Revit.DB Namespace